---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ElementFailures
source: html/e1d4f775-388c-aecd-e9a4-89abec86de80.htm
---
# BuiltInFailures.ElementFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.